Documents/ПередачаНаКомиссию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПередачаНаКомиссию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.РасходыДоходы</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаКомиссии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупкиСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКомитента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаКомиссии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаКомиссии</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКомиссионера</Name>
					<Comment>Сумма по к-рой товар передан на комиссию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наценка</Name>
					<Comment>в валюте док-та продажи</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВБазВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НаценкаВБазВалюте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПрихода</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/РасходыДоходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>РасходыДоходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДоходРасход</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПередачаНаКомиссию/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
    омСервер.ЗаписатьОбщиеРеквизиты(ЭтотОбъект);
    Количество = Товары.Итог("Количество");
	Сумма = Товары.Итог("Сумма");  
	
	// заполним затраты
	Затраты = ПроведениеДокументов.ЗатратыПартий(Товары.ВыгрузитьКолонку("Партия"));
	Для Каждого Стр Из Товары Цикл  
		
		Если ЗначениеЗаполнено(Стр.Партия) Тогда 
			
			ЦенаЗатратПартии = Затраты.ЗатратыПартии.Получить(Стр.Партия);  
			Если НЕ ЗначениеЗаполнено(ЦенаЗатратПартии) Тогда
				ЦенаЗатратПартии = 0;
			КонецЕсли; 
			ЦенаЗатратПартииИнв = Затраты.ЗатратыПартииИнвойсов.Получить(Стр.Партия);  
			Если НЕ ЗначениеЗаполнено(ЦенаЗатратПартииИнв) Тогда
				ЦенаЗатратПартииИнв = 0;
			КонецЕсли; 
			ЦенаЗатрат = РаботаСВалютой.Пересчитать2025(ЦенаЗатратПартии + ЦенаЗатратПартииИнв, Валюта, ПараметрыСеанса.БазоваяВалюта, Фирма, Дата); 
			Стр.ЦенаЗакупкиСЗатратами = ЦенаЗатрат + Стр.ЦенаЗакупки;  
							
		Иначе	
			
		КонецЕсли;
		
	КонецЦикла; 	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ОбщегоНазначенияСервер.ЗаполнитьРеквизитыДокументаПоУмолчанию(ЭтотОбъект);
    Валюта = ПараметрыСеанса.БазоваяВалюта;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ТаблицаТовары = ТаблицаТовары();
	ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если Валюта = ПараметрыСеанса.БазоваяВалюта Тогда
		К = 1;	
	Иначе
		К = РаботаСВалютой.Курс(Валюта, Дата, Фирма);
	КонецЕсли;
	//Доход = 0;
	
	Движения.ОстаткиТовара.Записывать 		= Истина;
	Движения.ТоварыНаКомиссии.Записывать 	= Истина;
	Движения.Продажи.Записывать 			= Истина;
    Движения.РасходыДоходы.Записывать 		= Истина;
	//Движения.Долги.Записывать				= Истина;
	
	Для Каждого ТекСтрокаТовары Из ТаблицаТовары Цикл  
		
		// РН ОстаткиТовара
		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 		= ТекСтрокаТовары.Партия;
		Движение.Склад 			= Склад;
		Движение.Фирма 			= Фирма;
		Движение.Остаток 		= ТекСтрокаТовары.Количество; 

		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 		= ТекСтрокаТовары.Партия;
		Движение.Склад 			= СкладКомиссии;
		Движение.Фирма 			= Фирма;
		Движение.Остаток 		= ТекСтрокаТовары.Количество; 
		
		// РН ТоварыНаКомиссии
		Движение = Движения.ТоварыНаКомиссии.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход; 
		Движение.Период 			= Дата;
 		Движение.Номенклатура 		= ТекСтрокаТовары.Номенклатура;
		Движение.Партия 			= ТекСтрокаТовары.Партия;
		Движение.Контрагент 		= Контрагент;
		Движение.Склад 				= СкладКомиссии;
        Движение.Количество			= ТекСтрокаТовары.Количество;
        Движение.Сумма				= ТекСтрокаТовары.ЦенаЗакупкиСЗатратами * ТекСтрокаТовары.Количество;
		Движение.СуммаКомиссионера 	= ТекСтрокаТовары.Сумма; 
		
		//// РН Продажи
		//Движение = Движения.Продажи.Добавить(); 
		//Движение.Период				= Дата;
		//Движение.Номенклатура		= ТекСтрокаТовары.Номенклатура;
		//Движение.Партия				= ТекСтрокаТовары.Партия;
		//Движение.ДокументПрихода	= ТекСтрокаТовары.ДокументПрихода;
		//Движение.Покупатель			= Контрагент;
		//Движение.Поставщик			= ТекСтрокаТовары.Поставщик;
		//Движение.Валюта				= Валюта;
		//Движение.Автор				= КемСоздан;
		//Движение.Склад				= Склад;
		//Движение.Фирма				= Фирма;
		//Движение.Количество			= ТекСтрокаТовары.Количество;
		//Движение.Сумма				= ТекСтрокаТовары.Сумма;
		//Движение.Наценка			= ТекСтрокаТовары.Сумма - ТекСтрокаТовары.ЦенаЗакупкиСЗатратами * ТекСтрокаТовары.Количество;
		//Движение.СуммаВБазВалюте	= Движение.Сумма * К;
		//Движение.НаценкаВБазВалюте	= Движение.Наценка * К;   
		//Доход = Доход + Движение.НаценкаВБазВалюте;
		
	КонецЦикла;
	
	//// РН РасходыДоходы
	//Движение = Движения.РасходыДоходы.Добавить();
	//Движение.Период 	= Дата;
	//Движение.Фирма 		= Фирма;
	//Движение.Вид 		= Перечисления.ДоходРасход.Доход;
	//Движение.Статья 	= Статья;
	//Движение.Валюта 	= Валюта;
	//Движение.Сумма 		= Доход;

	//// РН Долги
	//Движение = Движения.Долги.ДобавитьПриход();
	//Движение.Период 				= Дата;
	//Движение.Фирма 					= Фирма;
	//Движение.Док 					= Ссылка;
	//Движение.Валюта 				= Валюта;
	//Движение.Контрагент 			= Контрагент;
	//Движение.ДолгПокупателя 		= Доход;
	//Движение.ПредоплатаПокупателя 	= 0;
	//Движение.ДолгПоставщику 		= 0;
	//Движение.ПредоплатаПоставщику 	= 0;
	
КонецПроцедуры

Процедура ПроверкаВозможностиПроведения(ТаблицаТовары, Отказ)
	
	Ошибки = Новый СписокЗначений;
	
	// Запрет незаполненных установлен в свойствах реквизитов шапки
	//ПроведениеДокументов.ПроверитьЗаполнениеРеквизитов(ЭтотОбъект, "Контрагент,Склад,СкладКомиссии,Валюта", Отказ); 
	
	ПроведениеДокументов.ПроверитьНаТолькоТовары(ТаблицаТовары, Ошибки);
	ПроведениеДокументов.ПроверитьНаОстаткиТоваров(ТаблицаТовары, МоментВремени(), Склад, Ошибки, Фирма);
	ПроведениеДокументов.ПроверитьДубли(ТаблицаТовары, Ошибки);	
	
	Для каждого Ош Из Ошибки Цикл
		Отказ = Истина;
		Сообщить(Ош.Значение);
	КонецЦикла; 
	
КонецПроцедуры

Функция ТаблицаТовары()

	СтруктураПолей = Новый Структура;
	СтруктураПолей.Вставить("Номенклатура",			"Номенклатура");
	СтруктураПолей.Вставить("ТипНоменклатуры",		"Номенклатура.ТипНоменклатуры");
	СтруктураПолей.Вставить("ЗапретОтгрузки",		"Номенклатура.ЗапретОтгрузки");
	СтруктураПолей.Вставить("Серия",				"Серия");
	СтруктураПолей.Вставить("Партия",				"Партия");
	СтруктураПолей.Вставить("Количество",			"Количество");
	СтруктураПолей.Вставить("ЦенаЗакупки",			"ЦенаЗакупки");
	СтруктураПолей.Вставить("ЦенаЗакупкиСЗатратами","ЦенаЗакупкиСЗатратами");
	СтруктураПолей.Вставить("ЦенаКомитента",		"ЦенаКомитента");
	СтруктураПолей.Вставить("Сумма",				"Сумма");   
	СтруктураПолей.Вставить("ДокументПрихода",		"Партия.Док");   
	СтруктураПолей.Вставить("Поставщик",			"Партия.Контрагент");   
	
	ЗапросТовары = ПроведениеДокументов.СформироватьЗапросПоТабличнойЧасти(ЭтотОбъект, "Товары", СтруктураПолей);
	ТаблицаТовары = ЗапросТовары.Выгрузить();
	
    Возврат ТаблицаТовары;
	
КонецФункции
